app/services/interest_calculation_service.rb

SELECT "accounts".* FROM "accounts" WHERE (interest_rate > 0) ORDER BY "accounts"."id" ASC LIMIT $1  [["LIMIT", 1000]]
---
  def call
    Account.transaction do
      Account.where("interest_rate > 0").find_each do |account|

UPDATE "accounts" SET "balance" = $1, "updated_at" = $2 WHERE "accounts"."id" = $3  [["balance", "1050.0"], ["updated_at", "2026-02-11 16:39:18.857092"], ["id", 4]]
INSERT INTO "ledger_entries" ("account_id", "amount", "entry_type", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["account_id", 4], ["amount", "50.0"], ["entry_type", "interest"], ["created_at", "2026-02-11 16:39:18.860356"], ["updated_at", "2026-02-11 16:39:18.860356"]]
---
  def calculate_interest_for(account)
    # Simple interest calculation: Balance * Rate / 100
    # In a real app, this might be daily/monthly. Here it's a "trigger" event.
    interest_amount = (account.balance * account.interest_rate / 100.0).round(2)

    if interest_amount > 0
      account.with_lock do
        account.balance += interest_amount
        account.save!

        LedgerEntry.create!(
          account: account,
          amount: interest_amount,
          entry_type: 'interest'
        )