app/services/internal_transfer_service.rb

  def create_ledger_entry(account, amount, type)
    account.ledger_entries.create!(
      amount: amount,
      entry_type: type,
      # occurred_at handled by timestamps
    )
---
INSERT INTO "ledger_entries" ("account_id", "amount", "entry_type", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["account_id", 1], ["amount", "-100.0"], ["entry_type", "transfer_out"], ["created_at", "2026-02-10 16:10:18.881999"], ["updated_at", "2026-02-10 16:10:18.881999"]]