app/controllers/admin/accounts_controller.rb

    def new
      @users = User.all
---
SELECT "users".* FROM "users"

    def create
      @user = User.find(params[:account][:user_id])
      type = params[:account][:type]
      interest_rate = params[:account][:interest_rate] || 0.0

      # Security: Whitelist allowed types
      unless %w[SavingsAccount InvestingAccount].include?(type)
        redirect_to new_admin_account_path, alert: "Invalid account type"
        return
      end

      # Dynamically create the account type
      @account = type.constantize.new(user: @user, balance: 0, interest_rate: interest_rate)

      if @account.save
        redirect_to root_path, notice: "#{type} created successfully for #{@user.name}"
      else
        @users = User.all
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
INSERT INTO "accounts" ("user_id", "type", "balance", "created_at", "updated_at", "interest_rate", "name") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["user_id", 2], ["type", "SavingsAccount"], ["balance", "0.0"], ["created_at", "2026-02-10 17:05:23.947395"], ["updated_at", "2026-02-10 17:05:23.947395"], ["interest_rate", "10.0"], ["name", nil]]
SELECT "users".* FROM "users"

    def index
      @accounts = Account.includes(:user).order(created_at: :desc)
---
SELECT "accounts".* FROM "accounts" ORDER BY "accounts"."created_at" DESC
SELECT "users".* FROM "users" WHERE "users"."id" IN ($1, $2, $3, $4)  [["id", 4], ["id", 3], ["id", 2], ["id", 1]]

    def show
      @account = Account.find(params[:id])
      @ledger_entries = @account.ledger_entries.order(created_at: :desc)
---
SELECT "accounts".* FROM "accounts" WHERE "accounts"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
SELECT "ledger_entries".* FROM "ledger_entries" WHERE "ledger_entries"."account_id" = $1 ORDER BY "ledger_entries"."created_at" DESC  [["account_id", 4]]
SELECT COUNT(*) FROM "ledger_entries" WHERE "ledger_entries"."account_id" = $1  [["account_id", 4]]