app/controllers/admin/deposits_controller.rb

SELECT "deposits".* FROM "deposits" WHERE "deposits"."status" = $1 ORDER BY "deposits"."created_at" DESC  [["status", "pending"]]
---
    def index
      @deposits = Deposit.where(status: "pending").order(created_at: :desc)

SELECT "deposits".* FROM "deposits" WHERE "deposits"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
UPDATE "deposits" SET "status" = $1, "updated_at" = $2 WHERE "deposits"."id" = $3  [["status", "approved"], ["updated_at", "2026-02-11 16:06:49.543165"], ["id", 3]]
UPDATE "accounts" SET "balance" = $1, "updated_at" = $2 WHERE "accounts"."id" = $3  [["balance", "250.0"], ["updated_at", "2026-02-11 16:06:49.612805"], ["id", 2]]
INSERT INTO "ledger_entries" ("account_id", "amount", "entry_type", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["account_id", 2], ["amount", "50.0"], ["entry_type", "transfer_in"], ["created_at", "2026-02-11 16:06:49.614240"], ["updated_at", "2026-02-11 16:06:49.614240"]]
---
    def approve
      @deposit = Deposit.find(params[:id])

      ActiveRecord::Base.transaction do
        @deposit.update!(status: "approved")

        # Credit the account
        account = @deposit.account
        account.with_lock do
          account.balance += @deposit.amount
          account.save!

          LedgerEntry.create!(
            account: account,
            amount: @deposit.amount,
            entry_type: "transfer_in" # Utilizing existing type for deposit
          )