app/controllers/admin/transfers_controller.rb

    def new
      @accounts = Account.includes(:user).all.group_by(&:user)
---
SELECT "accounts".* FROM "accounts"
SELECT "users".* FROM "users" WHERE "users"."id" IN ($1, $2, $3, $4)  [["id", 1], ["id", 2], ["id", 4], ["id", 3]]

    def create
      @source = Account.find(params[:source_id])
      @target = Account.find(params[:target_id])
---
SELECT "accounts".* FROM "accounts" WHERE "accounts"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
SELECT "accounts".* FROM "accounts" WHERE "accounts"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]