app/views/dashboards/show.html.erb

SELECT "ledger_entries".* FROM "ledger_entries" WHERE "ledger_entries"."account_id" = $1  [["account_id", 1]]
---
        <tbody class="bg-white divide-y divide-gray-200">
          <% @user.accounts.flat_map(&:ledger_entries).sort_by(&:created_at).reverse.each do |entry| %>