app/views/dashboards/show.html.erb

  <div class="grid grid-cols-2 gap-6 mb-8">
    <% @user.accounts.each do |account| %>
---
SELECT "accounts".* FROM "accounts" INNER JOIN "account_users" ON "accounts"."id" = "account_users"."account_id" WHERE "account_users"."user_id" = $1  [["user_id", 11]]


    <% if @user.accounts.empty? %>
---
SELECT "accounts".* FROM "accounts" WHERE "accounts"."user_id" = $1  [["user_id", 1]]

        <tbody class="bg-white divide-y divide-gray-200">
          <% @user.accounts.flat_map(&:ledger_entries).sort_by(&:created_at).reverse.each do |entry| %>
---
SELECT "accounts".* FROM "accounts" WHERE "accounts"."user_id" = $1  [["user_id", 2]]
SELECT "ledger_entries".* FROM "ledger_entries" WHERE "ledger_entries"."account_id" = $1  [["account_id", 11]]