app/controllers/accounts_controller.rb

SELECT "ledger_entries".* FROM "ledger_entries" WHERE "ledger_entries"."account_id" = $1 ORDER BY "ledger_entries"."created_at" DESC  [["account_id", 4]]
---
  def show
    # @account is set by before_action
    @ledger_entries = @account.ledger_entries.order(created_at: :desc)

UPDATE "accounts" SET "updated_at" = $1, "name" = $2 WHERE "accounts"."id" = $3  [["updated_at", "2026-02-11 14:46:13.088095"], ["name", "Oat's Saving"], ["id", 3]]
---
  def update
    if @account.update(account_params)

SELECT "accounts".* FROM "accounts" INNER JOIN "account_users" ON "accounts"."id" = "account_users"."account_id" WHERE "account_users"."user_id" = $1 AND "accounts"."id" = $2 LIMIT $3  [["user_id", 11], ["id", 11], ["LIMIT", 1]]
---
  def set_account
    @account = current_user.accounts.find(params[:id])