app/controllers/deposits_controller.rb

  def create
    @deposit = Deposit.new(deposit_params.except(:account_type))
    @deposit.account = current_user.accounts.find_by(type: deposit_params[:account_type])

    if @deposit.account && @deposit.save
---
SELECT "accounts".* FROM "accounts" INNER JOIN "account_users" ON "accounts"."id" = "account_users"."account_id" WHERE "account_users"."user_id" = $1 AND "accounts"."type" = $2 LIMIT $3  [["user_id", 3], ["type", "SavingsAccount"], ["LIMIT", 1]]
INSERT INTO "deposits" ("account_id", "amount", "status", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["account_id", 1], ["amount", "200.0"], ["status", "pending"], ["created_at", "2026-02-11 15:38:07.004453"], ["updated_at", "2026-02-11 15:38:07.004453"]]
UPDATE "deposits" SET "updated_at" = $1 WHERE "deposits"."id" = $2  [["updated_at", "2026-02-11 15:38:07.235889"], ["id", 1]]