app/controllers/sessions_controller.rb

SELECT "users".* FROM "users" WHERE "users"."name" = $1 LIMIT $2  [["name", "Alice"], ["LIMIT", 1]]
---
  def create
    user = User.find_by(name: params[:name])