app/controllers/transfers_controller.rb

  def create
    # In a real app, use current_user.accounts.find...
    # For demo simplicity, we might trust params or assume current_user is set.
    # We'll assume a current_user method exists (simulated or real).

    source = current_user.accounts.find(params[:source_id])
    target = current_user.accounts.find(params[:target_id])
    amount = params[:amount].to_d

    begin
      InternalTransferService.new(source, target, amount).call

      respond_to do |format|
        format.turbo_stream {
          render turbo_stream: turbo_stream.update("flash", partial: "layouts/flash", locals: { notice: "Transfer Complete" })
        }
        format.html { redirect_to root_path, notice: "Transfer Complete" }
      end
    rescue InternalTransferService::TransferError => e
      respond_to do |format|
        format.turbo_stream {
          render turbo_stream: turbo_stream.update("flash", partial: "layouts/flash", locals: { alert: e.message })
---
SELECT "accounts".* FROM "accounts" WHERE "accounts"."user_id" = $1 AND "accounts"."id" = $2 LIMIT $3  [["user_id", 1], ["id", 1], ["LIMIT", 1]]
UPDATE "accounts" SET "balance" = $1, "updated_at" = $2 WHERE "accounts"."id" = $3  [["balance", "900.0"], ["updated_at", "2026-02-10 16:10:18.893639"], ["id", 1]]