app/views/layouts/application.html.erb

                <%= link_to "Transfer", new_admin_transfer_path, class: "text-blue-600 hover:text-blue-800 mr-4 font-semibold" %>
                <% pending_count = Deposit.where(status: 'pending').count %>
---
SELECT COUNT(*) FROM "deposits" WHERE "deposits"."status" = $1  [["status", "pending"]]